Revit 2027 API
AnalyticalEquipmentLoadData.PhasesNumber Property
 The number of electrical phases of the analytical equipment load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int PhasesNumber { get; set; }
Public Property PhasesNumber As Integer
	Get
	Set
public:
property int PhasesNumber {
	int get ();
	void set (int value);
}
member PhasesNumber : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The number of electrical phases numberOfPhases is not valid, only 1, 3 is valid.
Remarks
 This property is used to retrieve the number of electrical phases.
See Also
Reference
AnalyticalEquipmentLoadData Class
Autodesk.Revit.DB.Electrical Namespace